import{f as x,g as k,h as R,i as A,t as B,u as F,j as G,_ as E,o as d,c as g,k as N,v as $,a as m,n as v,l as P,F as T,m as M,p as b,q as S,s as D}from"./app-Cw3C0pq9.js";const U=[{path:"/",title:"",pathLocale:"/",contents:[{header:"📣 最新更新",slug:"📣-最新更新",content:`2024-04-04 旧约圣经 | 创世记 | 2024-03-31 | 完成度：32% 网站更新 | wangxinleo | feat(代码更新): 更换新架构
加入全文搜索 2024-03-31 网站更新 | wangxinleo | feat(代码更新): 增加目录页 2024-03-30 网站更新 | wangxinleo | fix(代码更新): 丰富了导航栏的图标，调整了网站结构
删除不必要的文件，精简代码
迁移仓库至github
设置 favicon.ico
增加打包脚本 网站更新 | wangxinleo | doc(文档更新): 修订一些错别字和迁移仓库
更新了使用github仓库相关的内容，使指引更加人性化
修正了章节认领的歧义部分
去除链接邀请和扫码加入的相关内容 2022-03-04 旧约圣经 | 创世记 | 2020-12-19 | 完成度：15%`},{header:"💬 参与讨论",slug:"💬-参与讨论",content:"欢迎来到仓库 Issue 留言区进行踊跃留言，留下你宝贵的意见，帮助我们走得更远，做得更好。"},{header:"📚 《圣经脑图》电子书打包下载",slug:"📚-《圣经脑图》电子书打包下载",content:`TIP
都还没完成呢！敬请期待吧~`}]},{path:"/QFA/",title:"Q&A",pathLocale:"/",contents:[{header:"Q&A",slug:"q-a",content:""},{header:"xmind文件如何使用",slug:"xmind文件如何使用",content:`提示
1.电脑用户点击此链接，下载 Xmind2020 打开下述文件。
2.手机用户点击此链接，下载 Xmind移动版 打开下述文件。
3.您也可以直接保存以下图片，在本地放大查看 手机用户：长按图片保存；
电脑用户：右键图片，选择【图片另存为】或【在新标签页中查看】；`}]},{path:"/book/Exodus.html",title:"出埃及记",pathLocale:"/",contents:[{header:"出埃及记",slug:"出埃及记",content:"未开始写作，敬请期待。"}]},{path:"/book/Genesis.html",title:"创世记",pathLocale:"/",contents:[{header:"创世记",slug:"创世记",content:""},{header:"文件下载",slug:"文件下载",content:"点击下方链接，下载文件 📃创世记.xmind"},{header:"大图浏览",slug:"大图浏览",content:""},{header:"索引",slug:"索引",content:`创世记 神的创造 (创世记 1:1-2:3) 开始的创造 (1:1) "起初神创造天地。" 创世之前 (1:2) 地是空虚混沌，渊面黑暗
神的灵运行在水面上 六日创造 第一日 (1:3-5) 调光造昼夜
"神说：‘要有光’，就有了光。" 第二日 (1:6-8) 设立穹苍，分别水与水 第三日 (1:9-13) 使水聚成海，陆地出现
产生植物，各从其类 第四日 (1:14-19) 创建天体，以分昼夜，定节令 第五日 (1:20-23) 海里满有生物，天空有飞鸟 第六日 (1:24-31) 造走兽、牲畜、爬物
造人类，照神的形象
"看着一切所造的都甚好。" 第七日 (2:1-3) 神休息，不再工作
神赐福并圣化这日，因为在这日休息 伊甸园 (创世记 2:4-3:24) 环境与生命的起源 (2:4-17) 创造人类 (2:7) 神用地上的尘土造人，吹入生命之气，成为活人 伊甸园的创立 (2:8-14) 神在伊甸造园子，把造的人安置在那里
园中种满了各种好看好吃的树
生命树和知善恶树也在园中
园外有四条河流：比逊、基训、希底结、幼发拉底
这些河流浇灌伊甸园，也分流到周围的地区 人的职责与禁令 (2:15-17) 人被安置在伊甸园里，去耕种并看守
神命令人可以吃园中任何树的果子
唯独知善恶树的果子不可吃，吃了就必定死亡 人的不孤单 (2:18-25) 造动物，亚当命名
造女人，为亚当的帮手 人的堕落 (3:1-7) 蛇的诱惑
夏娃的欺骗，亚当的顺从
发现赤身裸体的羞耻 堕落之罪的后果 (3:8-24) 亚当、夏娃和蛇的指控
神对三者的判决 蛇：永世之仇，俯伏行走
女人：增加生产痛苦，丈夫掌权
男人：必须辛劳才能得食
大地：被咒诅，长出荆棘蒺藜 人类被赶出伊甸园，防止其吃生命树的果子
安置基路伯和璀璨剑光守卫伊甸园 亚当的后代 (4:1-4:26) 该隐与亚伯：兄弟之间的冲突和该隐的流亡 亚当和夏娃生育该隐和亚伯 亚当和夏娃的第一个儿子该隐，意为“得”，因为夏娃说她得了一个男孩与耶和华同工
亚当和夏娃的第二个儿子亚伯，成为牧羊人，而该隐成为农夫 该隐和亚伯献祭 亚伯献上羊群中头生的和它的脂油，耶和华看中了亚伯和他的供物
该隐也献上地里的出产，但耶和华不看中该隐和他的供物 该隐的嫉妒和杀害亚伯 该隐因耶和华看中亚伯和他的供物而心中发怒，面带愠色
该隐诱导亚伯到田间，起来打死了他 该隐被责罚和流亡 耶和华质问该隐亚伯的下落，该隐否认，并回应“我岂是我弟弟的看守人？”
耶和华判定该隐，使他在地上受咒诅，成为飘流不定的人
该隐离开耶和华的面，到了挪得之东边居住 该隐的后裔：第一个城市的建立与发展 该隐娶妻生儿，建立城市 该隐生以诺，并在以诺的名字上建立了一座城 该隐的子孙和他们的成就 以诺生以拿，以拿生米户雅利，米户雅利生玛土撒利，玛土撒利生拉麦
拉麦娶了两个妻，一个名亚大，一个名洗拉 拉麦对妻子说的话，展现的强烈报复欲：“若杀该隐、遭报七倍、杀拉麦、必遭报七十七倍”
上面这句话不是神说的，是拉麦自己说的。彰显自己比神厉害，我自己能保护自己，伤害我的报应更大 亚大生雅八，他是住帐棚牧养牲畜之人的始祖
亚大的另一个儿子是犹八，他是一切弹琴吹箫之人的始祖
洗拉生了土八该隐，他是打造各样铜铁利器的，土八该隐的妹妹是拿玛 塞特的出生和人类呼求耶和华的名 亚当和夏娃生塞特 亚当和夏娃认为神赐给他们一个儿子代替被该隐杀的亚伯 人类开始呼求耶和华的名 塞特生了儿子以挪士，那时候人开始呼求耶和华的名 从亚当到挪亚的家谱 (5:1-5:32) 通过家谱展示神的恩典和人类的延续 亚当 (Adam) 活了130岁生塞特 (Seth)
生塞特后还活了800年
总年龄: 930岁 塞特 (Seth) 活了105岁生以挪士 (Enosh)
生以挪士后还活了807年
总年龄: 912岁 以挪士 (Enosh) 活了90岁生肯南 (Kenan)
生肯南后还活了815年
总年龄: 905岁 肯南 (Kenan) 活了70岁生玛勒列 (Mahalalel)
生玛勒列后还活了840年
总年龄: 910岁 玛勒列 (Mahalalel) 活了65岁生雅列 (Jared)
生雅列后还活了830年
总年龄: 895岁 雅列 (Jared) 活了162岁生以诺 (Enoch)
生以诺后还活了800年
总年龄: 962岁 以诺 (Enoch) 活了65岁生玛土撒拉 (Methuselah)
生玛土撒拉后还活了300年
特别记载：以诺与上帝同行，上帝将他取走了
总年龄：365岁 玛土撒拉 (Methuselah) 活了187岁生拉麦 (Lamech)
生拉麦后还活了782年
总年龄: 969岁 拉麦 (Lamech) 活了182岁生挪亚 (Noah)
生挪亚后还活了595年
总年龄: 777岁 挪亚 (Noah) 500岁时生了三个儿子：闪、含、雅弗
圣经记载挪亚当时是个义人、完全人，与上帝同行。 挪亚的出生：预示为安慰人心的人 挪亚的出生对人类的希望和安慰
挪亚的名字与他的使命和重要性 人类的堕落与挪亚的义行 (6:1-6:22) 人类的恶行导致神的悲伤 描述人类的境况和罪恶的加剧 人类开始在地上繁衍，"但耶和华看见人在地上的恶多" (创世记 6:5)。
罪恶在人心中扎根，"心里想的每个念头常是恶的" (创世记 6:5)。 神的悲伤和对人类的审判 神后悔造了人在地上，心中忧伤，"耶和华就后悔造了人在地上，心中忧伤" (创世记 6:6)。
宣布对人类的审判，"我要把我所造的人...从地上除灭" (创世记 6:7)。 神决定毁灭人类，唯独拯救挪亚及其家庭 神的公义和怜悯在洪水中的体现 神决定用洪水来毁灭邪恶，"看哪，我要将洪水泛滥在地上" (创世记 6:17)。
神决定拯救挪亚和他的家庭，因为挪亚是义人，"但挪亚在耶和华眼前蒙恩" (创世记 6:8)。 挪亚和他家族的救赎和信靠 神与挪亚立约，"我与你立约，你要进入方舟" (创世记 6:18)。
挪亚遵命建造方舟并进去，展现了信靠，"挪亚就这样行，凡神所吩咐的，他都照样行了" (创世记 6:22)。 神的指示建造方舟 方舟的建造过程和细节 具体尺寸和材料的要求，"方舟的长三百肘，宽五十肘，高三十肘" (创世记 6:15)。
方舟的结构设计，包括房间、层楼和门，"方舟里你要做许多房间" (创世记 6:14)。 方舟的象征意义和拯救作用 方舟作为逃离即将到来的审判的避难所，"你要进入方舟 - 你和你的儿子、你的妻子、和你儿媳" (创世记 6:18)。
通过方舟，挪亚代表人类和动物的新生，"凡有血肉的生命，每样两个你要带到方舟里，保全其生" (创世记 6:19)。 大洪水的开始(7:1-8:22) 神对挪亚的最后指示 命令挪亚进入方舟，因为神看见他在这代人中是义的 (创世记 7:1)。
指示挪亚带上清洁的动物和不洁净的动物各七对和一对，以及食物 (创世记 7:2-3)。 洪水降临和方舟的封闭 挪亚和其家庭及各种生物进入方舟，遵行神的命令 (创世记 7:5-9)。
洪水如约降临，在地上持续四十天四十夜 (创世记 7:10-12)。
方舟被封闭，挪亚和所有同行的生物与世隔绝 (创世记 7:16)。 洪水肆虐和地球的淹没 洪水覆盖地球，所有山峰都被淹没 (创世记 7:19-20)。
地上的生物全部死亡，唯有在方舟中的生物生存 (创世记 7:21-23)。
水势在地上盛行一百五十天 (创世记 7:24)。 大洪水的消退 (创世记 8:1-8:19)
神记念挪亚与方舟中的生物 神使风吹地，水势减退 (创世记 8:1)。
水源止住，雨也停止，水面开始逐渐下降 (创世记 8:2-3)。 方舟停靠和洪水的逐渐退去 方舟最终停在亚拉腊山上 (创世记 8:4)。
随着水位的下降，陆地开始显露 (创世记 8:5)。 挪亚探明洪水退去的状况 挪亚放出乌鸦和鸽子，以探知地面的干燥程度 (创世记 8:6-12)。
地面干燥后，挪亚和所有方舟中的生物得以出来 (创世记 8:13-19)。 神对挪亚的祝福和应许 (创世记 8:20-8:22)
挪亚献祭感谢神 挪亚建立坛，献上清洁动物和飞鸟作燔祭 (创世记 8:20)。
神闻其香气，决定不再因人类的缘故咒诅地 (创世记 8:21)。 神应许不再以洪水毁灭地球 神应许，地的岁月不再停止，冷暖、夏秋、昼夜继续交替 (创世记 8:22)。 神与挪亚立约 (9:1-9:29) 神祝福挪亚和他的儿子们，重申人类的使命 神赋予人类管理地球的责任 重新授予人类繁衍生息、管理地球的命令，"你们要生养众多，遍满地面" (创世记 9:1)。
再次强调人类对动物的统治权，"地上一切活着的动物都必畏惧你们" (创世记 9:2)。 神设立食物规定，赋予新的食物律法 允许人类吃肉，但禁止吃带有生命的血液，"惟独肉带着生命，就是它的血，你们不可吃" (创世记 9:4)。 神为生命设立律法和制裁措施 重视生命的神圣，确认杀人的严重后果 任何流人血的，他的血也要被人流，因为神按自己的形象造了人 (创世记 9:6)。
强调生命的价值，建立起对杀人行为的惩罚。 神与挪亚及其后代立约，承诺不再用洪水毁灭地球 展示永恒的慈爱和怜悯，确立与人类的新关系 与挪亚和他的后代，以及一切生命立约，"我与你们及你们的后裔立约" (创世记 9:9)。
承诺不再使用洪水灭绝生命，"凡有血肉的，不再被水洪灭绝" (创世记 9:11)。 神使用虹霓作为立约的记号 虹霓作为神不再用洪水毁灭世界的凭证 虹霓出现在云彩中作为与地上万物立约的记号，"我将我的虹放在云彩中，这就可作我与地立约的记号了" (创世记 9:13)。
每当虹霓出现，神会记念与地上万物立下的约。 挪亚的后代和新社会的开端 挪亚的家族扩展，新世界的人类社会出现 描述挪亚家族的子孙如何开始扩散，填充地球 (创世记 9:18-19)。 挪亚的个人生活和其影响 挪亚作为农夫的生活，他种植葡萄园 (创世记 9:20)。
记录了挪亚醉酒和裸露的事件以及子孙之间的互动，预示了未来家族和民族之间的关系 (创世记 9:21-27)。 挪亚的逝世 记录挪亚享年950岁，以及他的死亡 (创世记 9:28-29)。 诸族的分布 (创世记 10:1-10:32) 闪、含、雅弗的后代繁衍成不同的国家和民族 闪、含、雅弗的后代被列出，展示了人类如何从三个家庭分布到世界各地。
分别繁衍成不同的民族和语言，这些族群最终形成各个不同的国家。 巴别塔的故事 (创世记 11:1-11:9) 人类的团结与同一语言 描述人类如何在东方平原上定居并说同一种语言。
人们计划建造一座城市和一座通天的塔，旨在显示他们的力量和团结，"让我们建造一座城和一座塔，塔顶通天，为了使我们的名声传遍世界" (创世记 11:4)。 上帝对人类骄傲的干预 上帝观察到人类的行为和他们建塔的计划，决定干预以防止他们过于自负。
为了打断他们的计划，上帝使人们说不同的语言，从而无法继续交流和合作。 混乱后的分散 由于无法理解彼此的语言，人们停止了建塔的工程。
人们被分散到全地上，城市因此得到了“巴别”的名字，意味着“混乱”。 挪亚的后代继续繁衍 (创世记 11:10-11:32) 记录了从闪到亚伯兰（即亚伯拉罕）的家谱，这为后续故事埋下伏笔，连接了挪亚的后代和以色列人的祖先。 亚伯兰被召到迦南 (创世记 12:1-9) 神呼召亚伯兰离开家乡 神向亚伯兰显现并给予应许 神命令亚伯兰离开故土，"耶和华对亚伯兰说，你要离开你的国家、你的亲族和你父家，到我要指示你的地去" (创世记 12:1)。
神给亚伯兰应许，将他的后裔变成大国，"我必叫你成为大国，我也要赐福给你，使你的名为大" (创世记 12:2)。 亚伯兰对神的应许表示信任 亚伯兰的顺服与行动 亚伯兰遵从神的命令，离开哈兰去迦南地，"亚伯兰就照耶和华的话行去" (创世记 12:4)。
表示信仰，到达迦南地，亚伯兰竖立祭坛，"在耶和华显现给他的地方筑了一座祭坛" (创世记 12:7)。 亚伯兰在迦南的生活和挑战 (创世记 12:10-20, 13:1-18) 亚伯兰在迦南遇到饥荒 饥荒迫使亚伯兰下埃及 面对生存挑战，亚伯兰带着家人和所有财产下到埃及，"在那地遇到饥荒" (创世记 12:10)。
为保护撒莱，亚伯兰谎称她是妹妹，"请你说，你是我的妹妹" (创世记 12:13)。 神干预保护亚伯兰和撒莱 神因撒莱的事惩罚法老，"耶和华因亚伯兰妻子撒莱的缘故，降大灾与法老和他的家" (创世记 12:17)。
法老命令亚伯兰带着一切所得离开埃及，"给了人吩咐，送他走" (创世记 12:20)。 亚伯兰和罗得分离 (创世记 13:5-13) 亚伯兰和罗得财产增多引发争端 罗得和亚伯兰的牧人之间的冲突 由于地不够两个家庭牲畜放牧，"彼此的牧人就起了争执" (创世记 13:7)。 亚伯兰提出和平分离的建议 为避免争议，亚伯兰建议分开，"请从我这里分开" (创世记 13:9)。
罗得选择了看似丰饶的约旦河平原，"罗得举目看见约旦河的全平原" (创世记 13:10)。 亚伯兰与罗得分离后上帝的应许 (创世记 13:14-18) 上帝与亚伯兰的对话和应许 上帝对亚伯兰土地的应许 在亚伯兰与侄子罗得分离之后，上帝再次向亚伯兰显现，"耶和华对亚伯兰说..." (创世记 13:14)。
上帝应许给亚伯兰及其后代无限量的土地，"你举起你的眼睛，从你所在的地方...我要把你所看到的地都赐给你和你的后代永远" (创世记 13:14-15)。 上帝应许亚伯兰后裔繁多 上帝应许亚伯兰的后裔会像尘土一样无法计数，"我要使你的后裔如同地上的尘沙那样多，人若能数算地上的尘沙，才能数算你的后裔" (创世记 13:16)。 亚伯兰对上帝应许的响应 亚伯兰的旅程和迁移到希伯伦 亚伯兰遵照上帝的指示，开始在迦南地游行，"亚伯兰就搬了帐棚，来到希伯仑幔利的橡树那里居住" (创世记 13:18)。
他在那里筑了一座坛，专为上帝而建，显示了他对上帝应许的信仰和敬拜，"在那里为耶和华筑了一座坛" (创世记 13:18)。 战争爆发和罗德的被俘 (创世记 14:1-12) 四王与五王的战争 描述发生在所多玛与蛾摩拉地区的战争，多国交战的背景。 四王联盟与五王发生冲突，"那四王就来攻打所多玛和蛾摩拉王" (创世记 14:9)。 罗德，作为亚伯兰的侄儿，居住在所多玛，被卷入战争中。 所多玛和蛾摩拉战败，"所多玛和蛾摩拉王都败在西位谷" (创世记 14:10)。 罗德及其家产被掳 罗德和其他俘虏的状况，被四王联盟掳走。 罗德被四王带走，"他们掳掠了所多玛和蛾摩拉的一切财物和一切的粮食，就走了" (创世记 14:11)。 亚伯兰的追击与胜利 (创世记 14:13-16) 亚伯兰的决定和追兵 亚伯兰得知罗德被掳走的消息，"有一个逃脱的人告诉希伯来人亚伯兰" (创世记 14:13)。
亚伯兰集结了自己的家兵及盟友。 亚伯兰率领318名训练有素的家兵，"亚伯兰听见他侄子（罗德）被掳去，就率领他家中生养的三百十八名壮丁" (创世记 14:14)。 亚伯兰的胜利和罗德的解救 亚伯兰夜袭四王联盟，取得了胜利。 描述了亚伯兰追击并击败四王的过程，"他便夜间分队击败敌人" (创世记 14:15)。 罗德及其财产得到恢复。 亚伯兰成功地解救出罗德和其他被俘的人以及财物，"他追到大马士革以北的何把，将被掳掠的一切财物夺回来，连他侄子罗德和他的财物以及妇女人民也带回来" (创世记 14:16)。 亚伯兰与梅基洗德的相遇 (创世记 14:17-24) 梅基洗德，耶路撒冷的王，为亚伯兰祝福。 梅基洗德赞美神，因他交付了敌人到亚伯兰手中，"梅基洗德札冷王拿着饼和酒出来迎接，他是至高神的祭司" (创世记 14:18)。 亚伯兰拒绝所多玛王的报酬 所多玛王提出要给亚伯兰财物作为报酬，但亚伯兰拒绝。 亚伯兰拒绝了任何的财物，表明他的行为出于信仰和正义，"但亚伯兰对所多玛王说，‘我已经向耶和华，至高的神，创造天地的主起誓，我什么都不取’" (创世记 14:22)。 神与亚伯兰立约 (创世记 15:1-16:16) 神的应许与亚伯兰的疑惑 神向亚伯兰重申应许 神以异象的方式出现，"莫怕，亚伯兰，我是你的盾牌，必大大地赏赐你" (创世记 15:1)。
神应许亚伯兰后裔繁多，"你的后裔将要如此" (创世记 15:5)，并且将土地赐予他的后裔。 亚伯兰的疑问和求证 亚伯兰询问如何知道自己将要继承应许的土地，"主耶和华啊，我怎能知道必得为业呢？" (创世记 15:8)。 神与亚伯兰立约的仪式 立约仪式的准备 亚伯兰按照神的吩咐准备牺牲，"于是把这一切分半，各摆一对" (创世记 15:10)。 神的应许和亚伯兰的信心 神宣告对亚伯兰后裔的应许将会应验，"你的后裔必寄居别人的地" (创世记 15:13)。
神预告以色列人将会被奴役但最终得释放，"但第四代必回到此地" (创世记 15:16)。 夏甲和亚伯兰的儿子以实玛利的诞生 撒莱的建议与亚伯兰的行为 撒莱建议亚伯兰与仆女夏甲同房，"求你到我的使女那里去" (创世记 16:2)，以求得子嗣。
亚伯兰听从撒莱，与夏甲同房，并且夏甲怀孕。 哈该与撒莱的冲突 夏甲怀孕之后轻看撒莱，与撒莱产生矛盾。
撒莱虐待夏甲，导致夏甲逃离。 夏甲在旷野的遭遇 神使者与夏甲的相遇 神使者在旷野劝夏甲返回并向她预言，"耶和华的使者对她说...你要回到你主母那里服事她" (创世记 16:9)。 以实玛利的未来被预言 神使者对夏甲说，"你这使女必生一个儿子，可以给他起名叫以实玛利" (创世记 16:11)，预言以实玛利将成为野驴般的人。 神与亚伯拉罕立约 (17:1-17:27)
亚伯拉罕的盛情款待 (18:1-18:15)
索多玛和蛾摩拉的审判 (18:16-19:38)
亚伯拉罕与亚比米勒的关系 (20:1-20:18)
以撒的诞生与夏甲的离去 (21:1-21:34)
亚伯拉罕试炼：献以撒 (22:1-22:24)
撒拉的去世与以撒的婚事 (23:1-24:67)`}]},{path:"/book/Leviticus.html",title:"利未记",pathLocale:"/",contents:[{header:"利未记",slug:"利未记",content:"未开始写作，敬请期待。"}]},{path:"/book/List.html",title:"目录",pathLocale:"/",contents:[{header:"目录",slug:"目录",content:""},{header:"《圣经》",slug:"《圣经》",content:`旧约书卷
新约书卷 创世记
马太福音 出埃及记
马可福音 利未记
路加福音 民数记
约翰福音 申命记
使徒行传 约书亚记
罗马书 士师记
哥林多前书 路得记
哥林多后书 撒母耳记上
加拉太书 撒母耳记下
以弗所书 列王记上
腓利比书 列王记下
歌罗西书 历代志上
帖撒罗尼迦前书 历代志下
帖撒罗尼迦后书 以斯拉记
提摩太前书 尼希米记
提摩太后书 以斯帖记
提多书 约伯记
菲利门书 诗篇
希伯来书 箴言
雅各书 传道书
彼得前书 雅歌
彼得后书 以赛亚书
约翰一书 耶利米书
约翰二书 耶利米哀歌
约翰三书 以西结书
犹大书 但以理书
启示录 何西阿书 约珥书 阿摩司书 俄巴底亚书 约拿书 弥迦书 那鸿书 哈巴谷书 西番雅书 哈该书 撒迦利亚书 玛拉基书`}]},{path:"/book/Numbers.html",title:"民数记",pathLocale:"/",contents:[{header:"民数记",slug:"民数记",content:"未开始写作，敬请期待。"}]},{path:"/book/",title:"食用指南",pathLocale:"/",contents:[{header:"食用指南",slug:"食用指南",content:`圣经的内容涉及的内容十分广，我们项目团队在这里提供了一份食用指南，帮助你更好地使用《圣经脑图》。
无论是你刚刚开始学习《圣经脑图》还是想复习《圣经脑图》的内容，这份食用指南都能很好地帮助到你。`},{header:"阅读前警告⚠️",slug:"阅读前警告⚠️",content:`《圣经脑图》不适合完全没有圣经阅读经验的人阅读，需要各位至少一边看圣经一边对照我们的《圣经脑图》进行对应联系，担心看不懂《圣经脑图》的文字对应关系，请先浏览一遍圣经内容再尝试使用。
小册还在预编辑当中，所以内容是还没有完结甚至是不完整的，但是大家不需要担心发现错误后的纠错问题。因为《圣经脑图》对每一行文字每一个标点都负责任，但凡发布过的内容，都接受履行读者们的监督和纠错义务。
《圣经脑图》不会让你对圣经的了解一蹴而就，直接从圣经小白到滔滔不绝的灵魂导师，想读懂圣经必定是需要上帝给予给我们的智慧和个人花费足够的精力才行，当然《圣经脑图》的内容能够帮助你快速了解圣经章节的表层知识。`},{header:"社区交流",slug:"社区交流",content:`现在《圣经脑图》仍处于起步阶段，人员的招募以及交流社区的建立仍然需要时间。
欢迎大家在Issue评论讨论区中催促社区的建设。`},{header:"内容",slug:"内容",content:`近几年，总结自己阅读圣经的经验，也有我向弟兄姐妹交流获得的，也有身边的弟兄姐妹分享给我的。发现许多弟兄姐妹在阅读圣经的时候很难做到脑子有整个章节的故事脉络框架或者书信内容框架，即使真的坚持到最后读完了一遍圣经，仍然在回忆特定人物事件时，或者闭上书本回想某卷书讲到什么时，很大程度上都没办法回忆起来自己看了什么，阅读圣经仿佛没有成效。
所以，我们项目团队将圣经每一卷书的主要框架一一提炼出来，并整理成了思维导图。当然《圣经脑图》所涉及的内容远远不止思维导图，我们未来的想法是还包罗了一部分我认为重要的经文思考、关键经文和学习资料。
总的来说，整本小册涉及到了整本圣经的每一卷书，每一卷书中又包含了主干框架。每个框架都自成体系但是又可能会与其他主干中的内容有交集。这对我们项目队伍来说是个很大的挑战，但是我们相信借着耶稣基督的能力，我们能胜过这项挑战。
如果你是刚刚开始阅读《圣经脑图》的内容，可以根据自己，对症下药，找到相应的书卷对应阅读。但是学习单个书卷中的内容时不推荐你单单只看思维导图。
在你学习的过程中，思维导图能做到辅助建立知识体系，帮助你检验自身的学习成果，查漏补缺，但并不能替代日常圣经的学习。
《圣经脑图》的内容会持续的更新（更新日志都放在首页），毕竟圣经的知识点很广，知识导图的内容可能会存在勘误或者不清楚的地方，我们项目团队会尽全力地让《圣经脑图》贴合圣经主旨和其要表述地内容。
最后，学习圣经一定要配合实践，没有实践的知识是没有灵魂的。如果你真的想让主干知识烙印在自己的脑海里，请试着使用思维导图默想圣经内容，这一定是在你一天之中最cool的灵修时刻。`},{header:"记录与分享",slug:"记录与分享",content:`我个人使用思维导图已经两年了。对着成篇的文字画思维导图是一个很好的习惯，一方面能帮助自己理解知识，另一方面也能打造个人的知识体系，所以我也很推荐大家能养成这个习惯。
最后，这本《圣经脑图》不一定能让你在很短的时间内就让你的圣经知识突飞猛进，但是如果你能使用得当的话，绝对能让你对圣经有一个整体的认识。好了，食用指南结束了，接下来让我们进入圣经的海洋吧。`}]},{path:"/desc/",title:"👉 指引",pathLocale:"/",contents:[{header:"👉 指引",slug:"👉-指引",content:`《圣经脑图》是一个致力于帮助圣经读者建立圣经知识体系的辅助方案。
通过思维导图的模式，串联每一章书卷的知识零散点，以树状图的结构配合大脑思考，完成圣经阅读。
本项目于2020年12月15日在阅读圣经时突然诞生，诞生之后就立即撰写相关编写方案及团队招募策略。
感恩
感谢您点击这个链接，让我们在茫茫人海中相遇。
我相信每一个很酷的想法都需要一群很酷的人去实现。
这并不是世界上某一个人能完成的事情，我们需要一个团队，也许，在阅读的你就是未来团队的一份子。`},{header:"😋 食用指南",slug:"😋-食用指南",content:`如果你还不能了解《圣经脑图》是做什么的，我很推荐你先阅读一下
🍎 《圣经脑图》食用指南
虽然现在《圣经脑图》还是起步初创阶段，但仍然希望你可以对我们的项目抱有期待。`},{header:"📒 开始阅读",slug:"📒-开始阅读",content:"📣 点击进入 >>《圣经脑图》"},{header:"👫 加入我们",slug:"👫-加入我们",content:`TIP
如果你了解到了《圣经脑图》的创作意图和创作目标，并且表示这是一件很酷的事情诚邀您加入我们！🔻 我邀请你一起看看 👉 快速引导
它能告诉你当前阶段我对整个《圣经脑图》项目的创作计划，并很欢喜地邀请你加入到我们地编写团队之中，成为我们的一员`},{header:"📄 编写指南",slug:"📄-编写指南",content:`如果你不了解如何通过协作的方式进行编写，我想再告诉你一件很酷的事情。
你可以通过代码命令行的方式利用git技术提交你的作品和参与编辑。就算你对此一窍不通。
你能收获什么？ 参与到项目之中你可以学习到计算机行业最喜欢用的头脑风暴工具 Xmind 。 参与到项目之中你有可能学习到专注写作的 Markdown 语法。抛开Word，拥抱代码吧(滑稽)。 最重要的是，你参与到了一项很【酷】的服侍当中。 来读读这个吧，它会告诉你最想知道的。
✒️ 《圣经脑图》编写指南`},{header:"✏️ 写在最后",slug:"✏️-写在最后",content:"不论如何，感谢你点开《圣经脑图》这个稚嫩的初创项目，我们有很多的路要走，我们也需要很多的支持，感谢你看到这里，不管《圣经脑图》能否完成我们赋予它的使命，我们都感恩，在这里遇见你。❤️"}]},{path:"/list/",title:"章节认领",pathLocale:"/",contents:[{header:"章节认领",slug:"章节认领",content:`这个章节认领是干嘛的？
这个部分是专门为有意愿参与《圣经脑图》编写计划的作者们提供认领的。
如果你还不知道怎么认领章节的话，请先阅读以下文档噢！
>>> 编写指南 <<<`},{header:"第1部分--旧约圣经",slug:"第1部分-旧约圣经",content:`书卷
已建立仓储库
作品提交地址
编辑认领地址 创世记
√
📁点此进入
🙋我要认领 出埃及记
√
📁点此进入
🙋我要认领 利未记
√
📁点此进入
🙋我要认领 民数记
√
📁点此进入
🙋我要认领 申命记
√
📁点此进入
🙋我要认领 约书亚记
√
📁点此进入
🙋我要认领 士师记
√
📁点此进入
🙋我要认领 路得记
√
📁点此进入
🙋我要认领 撒母耳记上
√
📁点此进入
🙋我要认领 撒母耳记下
√
📁点此进入
🙋我要认领 列王记上
√
📁点此进入
🙋我要认领 列王记下
√
📁点此进入
🙋我要认领 历代志上
√
📁点此进入
🙋我要认领 历代志下
√
📁点此进入
🙋我要认领 以斯拉记
√
📁点此进入
🙋我要认领 尼希米记
√
📁点此进入
🙋我要认领 以斯帖记
√
📁点此进入
🙋我要认领 约伯记
√
📁点此进入
🙋我要认领 诗篇
√
📁点此进入
🙋我要认领 箴言
√
📁点此进入
🙋我要认领 传道书
√
📁点此进入
🙋我要认领 雅歌
√
📁点此进入
🙋我要认领 以赛亚书
√
📁点此进入
🙋我要认领 耶利米书
√
📁点此进入
🙋我要认领 耶利米哀歌
√
📁点此进入
🙋我要认领 以西结书
√
📁点此进入
🙋我要认领 但以理书
√
📁点此进入
🙋我要认领 何西阿书
√
📁点此进入
🙋我要认领 约珥书
√
📁点此进入
🙋我要认领 阿摩司书
√
📁点此进入
🙋我要认领 俄巴底亚书
√
📁点此进入
🙋我要认领 约拿书
√
📁点此进入
🙋我要认领 弥迦书
√
📁点此进入
🙋我要认领 那鸿书
√
📁点此进入
🙋我要认领 哈巴谷书
√
📁点此进入
🙋我要认领 西番雅书
√
📁点此进入
🙋我要认领 哈该书
√
📁点此进入
🙋我要认领 撒迦利亚书
√
📁点此进入
🙋我要认领 玛拉基书
√
📁点此进入
🙋我要认领`},{header:"第2部分--新约圣经",slug:"第2部分-新约圣经",content:`书卷
已建立仓储库
作品提交地址
编辑认领地址 马太福音
√
📁点此进入
🙋我要认领 马可福音
√
📁点此进入
🙋我要认领 路加福音
√
📁点此进入
🙋我要认领 约翰福音
√
📁点此进入
🙋我要认领 使徒行传
√
📁点此进入
🙋我要认领 罗马书
√
📁点此进入
🙋我要认领 哥林多前书
√
📁点此进入
🙋我要认领 哥林多后书
√
📁点此进入
🙋我要认领 加拉太书
√
📁点此进入
🙋我要认领 以弗所书
√
📁点此进入
🙋我要认领 腓利比书
√
📁点此进入
🙋我要认领 歌罗西书
√
📁点此进入
🙋我要认领 帖撒罗尼迦前书
√
📁点此进入
🙋我要认领 帖撒罗尼迦后书
√
📁点此进入
🙋我要认领 提摩太前书
√
📁点此进入
🙋我要认领 提摩太后书
√
📁点此进入
🙋我要认领 提多书
√
📁点此进入
🙋我要认领 菲利门书
√
📁点此进入
🙋我要认领 希伯来书
√
📁点此进入
🙋我要认领 雅各书
√
📁点此进入
🙋我要认领 彼得前书
√
📁点此进入
🙋我要认领 彼得后书
√
📁点此进入
🙋我要认领 约翰一书
√
📁点此进入
🙋我要认领 约翰二书
√
📁点此进入
🙋我要认领 约翰三书
√
📁点此进入
🙋我要认领 犹大书
√
📁点此进入
🙋我要认领 启示录
√
📁点此进入
🙋我要认领`}]},{path:"/plan/",title:"快速指引",pathLocale:"/",contents:[{header:"快速指引",slug:"快速指引",content:""},{header:"🤷‍♀️ 这个项目是什么？",slug:"🤷‍♀️-这个项目是什么",content:`一直有基督徒群体或圣经读者中听到 「我有读圣经，但我读到了后面就不知道整章书讲了什么」 这样的声音，网上搜索相关的资料也找不到关于圣经每卷书的过程脉络，无法形成知识体系，这也让我们有所思考，该如何让更多圣经读者真正地有效率地进行读圣经活动。
那么，读圣经的问题为什么不用以前我们读书做笔记的方式去解决呢？于是现在有了这样一个仓库，我们邀请广大基督徒、圣经读者、传道牧师等与我们一起编写这本 《圣经脑图》 ，分享自己对圣经的认识和参与圣经脑图的制作，为那些想系统地读圣经的读者们提供一个可借鉴阅读和形成圣经知识体系的思维导图，让更多圣经读者认识圣经、描绘圣经、爱上圣经。`},{header:"💡 快速引导",slug:"💡-快速引导",content:`查看 章节认领 ，了解本次思维导图需编写的章节内容
进入 章节认领 ，点击 【📁点此进入】 按钮， 通过 在线提交 的方式对内容进行补充； 详情请查看>> 编写指南 加入编写社群，了解项目编写情况
添加 《圣经脑图》 联系人（wecode2014），备注「圣经脑图」，拉你入群`},{header:"🔁 《圣脑导图》制作流程",slug:"🔁-《圣脑导图》制作流程",content:`事项
开始时间
结束时间
推进方式 内容编写&审核
2024年4月1日
2024年12月1日
由基督徒&圣经读者编写，编写团队共同筛选校验内容 修改与整理
2025年1月1日
2025年6月1日
对内容进行最终的查漏补缺 汇编与制作
2025年7月1日
待定
最终确定的内容将会以 Gitee Pages 和电子书的形式制作并展示 内容更新
即刻
永久
该仓库将始终保持开放状态，欢迎读者持续提交内容更新与补充的 PR`},{header:"👉 参与规范",slug:"👉-参与规范",content:`编写内容：
https://shimo.im/sheets/jKrD8dwxW3DdKqWt/MODOC/
软件要求： Xmind 2020 https://www.xmind.cn/xmind2020/ 编写要求： 撰写的内容需符合该章圣经原文原译 不求辞藻华丽，只需结构清晰，表述简洁，易读易懂 涉及参考资料的内容需要标明来源出处并获得作者授权（或符合作品许可证）`},{header:"📜 编写方式",slug:"📜-编写方式",content:`以参与贡献的方式，共同完成《圣经脑图》的初步编写。
具体内容包括但不限于： 圣经各章节思维导图，见 章节认领 个人思考和批注 FQA`},{header:"👩‍💻 参与编写者要求",slug:"👩‍💻-参与编写者要求",content:"我们的初衷是希望能够通过这个项目为读圣经的伙伴们整理出一个基本的圣经知识架构，提供圣经章节骨架，我们欢迎任何热爱圣经的个人或组织加入编写，如果你符合以下的任意条件，即可加入我们的编写队伍。 热爱圣经，每天都有阅读圣经的习惯。 有感动和时间预备参与到这项不一样的服侍当中。 具有 Xmind 软件使用经验和 markdown 写作经验(非必须)。 没有特别丰富的软件使用经验，但有较强的的信息检索与过滤能力。"},{header:"❓ 如何参与编写",slug:"❓-如何参与编写",content:"想要直接参与编写？点击查看 编写指南 想要围观？欢迎你在评论区留下你宝贵的意见。"},{header:"🏆 通过活动你可以获得",slug:"🏆-通过活动你可以获得",content:"一次亲身参与项目服侍的经历，并成为 《圣经脑图》 官方开源电子文档编写成员（将在《圣经脑图》电子书“编写成员”栏署名） 更清晰的圣经知识体系，你将会亲身体验知识网络从无到有的形成过程。"},{header:"🌟 License",slug:"🌟-license",content:"本作品采用知识共享署名-非商业性使用-相同方式共享 4.0 国际许可协议进行许可。"}]},{path:"/plan/guide.html",title:"编写指南",pathLocale:"/",contents:[{header:"编写指南",slug:"编写指南",content:"欢迎你参加《圣经脑图》的编写工作，会有更多人通过你的工作了解圣经、参与阅读圣经、爱上圣经。"},{header:"参与须知",slug:"参与须知",content:""},{header:"格式",slug:"格式",content:`TIP
如果您愿意参与，可以提交任何形式的作品到仓库中，期待弟兄姐妹的服侍~❤️ 现在你们可以根据自己拥有的资料和特长，自由提交你们能想到的内容了！ 文章格式使用 Markdown 脑图格式使用 *.xmind 文章格式需符合 编写规范`},{header:"内容",slug:"内容",content:"撰写的内容需符合该章圣经原文原译 不求辞藻华丽，只需结构清晰，表述简洁，易读易懂 涉及参考资料的内容需要标明来源出处并获得作者授权（或符合作品许可证）"},{header:"参与流程",slug:"参与流程",content:`具体操作指引 从 章节认领 中选择自己想要参与编写的部分后，前往 Issue 页面 进行内容认领。 选择自己想要认领的内容部分，对该 Issue 进行评论，评论内容为 「作者姓名+预计完成时间+备注」 ，如 「leo，预计 1 月 18 日完成部分内容」 ，收到用户名为 「wangxinleo」 的账号回复 「已确认」 后，代表你就可以开始编写工作，该 Issue 会被移至 「编写中」 状态。 确认领取后，可以到网站 章节认领 进入相应的文件夹。完成编写后，选择仓库中对应部分的文件夹通过 在线提交 ，将编辑好的*.xmind文件或*.md文档上传，审查团队将会对内容进行格式规范初审，通过后将会对 PR 进行合并，并发布你的作品，对应 Issue 进入 「需补充」 或 「已完成」 状态。
如何找到提交文档的地方？
进入 章节认领 后找到下图 如何提交文档？ gitee 网站 github 网站 审校专家团队会对 「已完成」 的内容进行内容正确性复审，通过后该内容对应 Issue 进入 「已通过」 状态，代表该部分内容已确认收录进《圣经脑图》中。`},{header:"任务状态说明",slug:"任务状态说明",content:`⏳ 待编写 该部分内容为空白，需要熟悉该部分的你建立思维导图分享给大家。
该部分内容可在 符合参与须知的情况下 自由提交 PR。 📝 编写中 该部分内容已经有人开始编写，但你同样可以参与，我们会将不同作者的内容综合编辑后展示，同时参与的开发者都可获得编写人员的身份。
该部分内容可在 符合参与须知的情况下 自由提交 PR。 🏷 需补充 该部分内容并没有全部完成，需要对该主题进行更加详细的补充。
该部分内容仅接受 符合主题且对已有内容进行补充 的 PR。 👫 待翻译 该部分内容已经完成，需要对该主题进行翻译。
该部分内容仅接受 符合主题且对已有内容进行补充 的 PR。 📔 已完成 该部分内容已经完成，但还没有经过审校专家团队进行审核。
该部分仅接受 原则性错误修改/额外信息补充 的 PR。 🚩 已通过 该部分内容已经完成，并通过了审校专家团队的审核。
该部分接受 原则性错误修改/过时信息更新/额外信息补充 的 PR。`}]},{path:"/plan/standard.html",title:"编写规范",pathLocale:"/",contents:[{header:"编写规范",slug:"编写规范",content:"标准的格式是优质内容的基础，制定本规范的目的是统一 文档内容中的中英文文字规范，提升内容的严谨度和美观度。"},{header:"空格",slug:"空格",content:""},{header:"中英文之间需要增加空格",slug:"中英文之间需要增加空格",content:"正确： 在 LeanCloud 上，数据存储是围绕 AVObject 进行的。 错误： 在LeanCloud上，数据存储是围绕AVObject进行的。 在 LeanCloud上，数据存储是围绕AVObject 进行的。 完整的正确用法： 在 LeanCloud 上，数据存储是围绕 AVObject 进行的。每个 AVObject 都包含了与 JSON 兼容的 key-value 对应的数据。数据是 schema-free 的，你不需要在每个 AVObject 上提前指定存在哪些键，只要直接设定对应的 key-value 即可。 例外：「豆瓣FM」等产品名词，按照官方所定义的格式书写。"},{header:"中文与数字之间需要增加空格",slug:"中文与数字之间需要增加空格",content:"正确： 今天出去买菜花了 5000 元。 错误： 今天出去买菜花了 5000元。 今天出去买菜花了5000元。"},{header:"数字与单位之间无需增加空格",slug:"数字与单位之间无需增加空格",content:`正确： 我家的光纤入户宽带有 10Gbps，SSD 一共有 10TB。 错误： 我家的光纤入户宽带有 10 Gbps，SSD 一共有 20 TB。 另外，度／百分比与数字之间不需要增加空格。
正确： *今天是 233° 的高温。*新 MacBook Pro 有 15% 的 CPU 性能提升。 错误： *今天是 233 ° 的高温。*新 MacBook Pro 有 15 % 的 CPU 性能提升。`},{header:"全角标点与其他字符之间不加空格",slug:"全角标点与其他字符之间不加空格",content:"正确： 刚刚买了一部 iPhone，好开心！ 错误： 刚刚买了一部 iPhone ，好开心！"},{header:"英文书写中标点符号后加空格",slug:"英文书写中标点符号后加空格",content:"正确： Try Git commands right from your web browser. Featuring some of your soon-to-be favorites: branch, add, commit, merge, revert, cherry-pick, rebase! 错误： Try Git commands right from your web browser.Featuring some of your soon-to-be favorites:branch,add,commit,merge,revert,cherry-pick,rebase!"},{header:"链接前后需增加空格",slug:"链接前后需增加空格",content:"正确： 此文档遵循 编写规范 要求。 错误： 此文档遵循编写规范 要求。 此文档遵循 编写规范要求。 此文档遵循编写规范要求。"},{header:"标点符号",slug:"标点符号",content:""},{header:"不重复使用标点符号",slug:"不重复使用标点符号",content:"正确： 德国队竟然战胜了巴西队！* 她竟然对你说「喵」？！* 错误： 德国队竟然战胜了巴西队！！ 德国队竟然战胜了巴西队！！！！！！！！ 她竟然对你说「喵」？？！！ 她竟然对你说「喵」？！？！？？！！"},{header:"全角和半角",slug:"全角和半角",content:""},{header:"在中文中使用全角标点",slug:"在中文中使用全角标点",content:'正确： 嗨！你知道嘛？今天前台的小妹跟我说「喵」了哎！ 核磁共振成像（NMRI）是什么原理都不知道？JFGI！ 错误： 嗨! 你知道嘛? 今天前台的小妹跟我说 "喵" 了哎! 嗨!你知道嘛?今天前台的小妹跟我说"喵"了哎! 核磁共振成像 (NMRI) 是什么原理都不知道? JFGI! 核磁共振成像(NMRI)是什么原理都不知道?JFGI!'},{header:"数字使用半角字符",slug:"数字使用半角字符",content:"正确： 这件蛋糕只卖 1000 元。 错误： 这件蛋糕只卖 １０００ 元。"},{header:"在英文中，或中文中遇到完整的英文整句、特殊名词，其內容使用半角标点",slug:"在英文中-或中文中遇到完整的英文整句、特殊名词-其內容使用半角标点",content:"正确： 乔布斯那句话是怎么说的？「Stay hungry, stay foolish.」 推荐你阅读《Hackers & Painters: Big Ideas from the Computer Age》，非常的有趣。 错误： 乔布斯那句话是怎么说的？「Stay hungry，stay foolish。」 推荐你阅读《Hackers＆Painters：Big Ideas from the Computer Age》，非常的有趣。"},{header:"全英文编辑环境中没有顿号（、），使用半角逗号代替",slug:"全英文编辑环境中没有顿号-、-使用半角逗号代替",content:"正确： branch, add, commit, merge, revert, cherry-pick, rebase! 错误： branch、add、commit、merge、revert、cherry-pick、rebase!"},{header:"名词",slug:"名词",content:""},{header:"专有名词使用正确的大小写",slug:"专有名词使用正确的大小写",content:"正确： 使用 Gitee 登录 我们的客户有 GitHub、Foursquare、Microsoft Corporation、Google、Facebook, Inc.。 错误： 使用 gitee 登录 使用 GITEE 登录 我们的客户有 github、foursquare、microsoft corporation、google、facebook, inc.。 我们的客户有 GITHUB、FOURSQUARE、MICROSOFT CORPORATION、GOOGLE、FACEBOOK, INC.。 我们的客户有 Github、FourSquare、MicroSoft Corporation、Google、FaceBook, Inc.。 我们的客户有 gitHub、fourSquare、microSoft Corporation、google、faceBook, Inc.。"},{header:"不要使用不地道的缩写",slug:"不要使用不地道的缩写",content:"正确： 我们需要一位熟悉 JavaScript、HTML5，至少理解一种框架（如 Backbone.js、AngularJS、React 等）的前端开发者。 错误： 我们需要一位熟悉 Js、h5，至少理解一种框架（如 backbone、angular、RJS 等）的 FED。"},{header:"有序列表",slug:"有序列表",content:""},{header:"在有序列表中， 汉语数字后使用顿号，阿拉伯数字后使用半角句号。",slug:"在有序列表中-汉语数字后使用顿号-阿拉伯数字后使用半角句号。",content:"正确： 一、xxxxxx 二、xxxxx 或 1.xxxxxx 2.xxxxxx 错误： 1、xxxxxxx 2、xxxxxx 或 一。xxxxxx 二。xxxxxx 或 一.xxxxxx 二.xxxxxxx"},{header:"参考资料",slug:"参考资料",content:`中文文案排版指北：https://mazhuang.org/wiki/chinese-copywriting-guidelines/
中文技术文档的写作规范：https://github.com/ruanyf/document-style-guide
中华人民共和国国家标准《党政机关公文格式》（GB/T 9704-2012）[7.3.3]`}]},{path:"/404.html",title:"",pathLocale:"/",contents:[{header:"",slug:"",content:"404 Not Found"}]}],j="update-vuepress-plugin-full-text-search2-search-index";var I=x(U),H=k(()=>{const n=new Map;for(const e of I.value)n.set(e.path,e);return n});import.meta.webpackHot&&(__VUE_HMR_RUNTIME__[j]=n=>{I.value=n});function J(n){const e=x([]);let r=null;return R(n,()=>{r&&clearTimeout(r),r=setTimeout(s,100)}),e;function s(){const u=n.value.toLowerCase().trim();if(!u){e.value=[];return}const a=new Map,t=new Set;for(const o of I.value)for(const l of V(o,u)){t.add(l.parentPageTitle);let i=a.get(l.parentPageTitle);i||(i=[],a.set(l.parentPageTitle,i)),i.push(l)}const c=[...t].sort((o,l)=>{const i=a.get(o);return a.get(l).length-i.length});e.value=[...a].flatMap(([,o])=>o).sort((o,l)=>o.parentPagePriority-l.parentPagePriority||c.indexOf(o.parentPageTitle)-c.indexOf(l.parentPageTitle)||o.priority-l.priority)}}function*V(n,e){const r=w(n.title,e);if(r){yield{path:n.path,parentPageTitle:y(n),title:n.title,display:r,page:n,content:null,parentPagePriority:1,priority:1};return}for(const s of n.contents){const u=w(s.header,e);if(u){yield{path:n.path+(s.slug?`#${s.slug}`:""),parentPageTitle:y(n),title:n.title,display:u,page:n,content:null,parentPagePriority:10,priority:2};continue}const a=w(s.content,e);a&&(yield{path:n.path+(s.slug?`#${s.slug}`:""),parentPageTitle:y(n),title:n.title,display:[{type:"header",str:`${s.header}
`},...a],page:n,content:null,parentPagePriority:10,priority:10})}}function y(n){const e=n.path.split("/");let r="/";return e[1]&&(r=`/${e[1]}/`),(H.value.get(r)||n).title}function w(n,e){const r=[];let s=0;const u=n.toLowerCase().replace(/\s/gu," ");let a=0,t=u.indexOf(e,a);if(t<0)return null;for(;t>=0;){const o=t+e.length;if(c(n.slice(a,t),"normal"),c(n.slice(t,o),"highlight"),a=o,t=u.indexOf(e,a),s>100)break}return c(n.slice(a),"normal"),r.filter(o=>o.str);function c(o,l){let i=o;l==="normal"&&i.length>100&&s===0&&(i=`… ${i.slice(-10)}`);let p=!1;if(s+i.length>100){if(r.some(f=>f.type==="ellipsis"))return;i=i.slice(0,Math.max(100-s,1)),p=!0}r.push({type:l,str:i}),s+=i.length,p&&(r.push({type:"ellipsis",str:" …"}),s+=2)}}var q={};const K=q,Q=A({name:"SearchBox",props:{locales:{type:Object,required:!1,default:()=>K}},setup(n){const{locales:e}=B(n),r=x(""),s=x(!1),u=x(-1),a=J(r),t=k(()=>r.value&&s.value&&a.value.length),c=F(),o=G(),l=k(()=>e.value[o.value]??{});function i(){if(!t.value)return;let h=u.value-1;h<0&&(h=a.value.length-1),f(h)}function p(){if(!t.value)return;let h=u.value+1;h>=a.value.length&&(h=0),f(h)}function f(h){u.value=h}function C(){u.value=-1}function O(h){if(!t.value)return;const L=a.value[h];L&&c.push(L.path)}return{query:r,focused:s,focusIndex:u,suggestions:a,activeSuggestion:t,onUp:i,onDown:p,focus:f,unfocus:C,go:O,locale:l}}}),X={class:"search-box",role:"search"},W=["placeholder"],z=["onMousedown","onMouseenter"],_=["href"],Y={key:0,class:"parent-page-title"},Z={class:"suggestion-row"},nn={class:"page-title"},en={class:"suggestion-content"};function tn(n,e,r,s,u,a){return d(),g("div",X,[N(m("input",{ref:"input","onUpdate:modelValue":e[0]||(e[0]=t=>n.query=t),"aria-label":"Search",class:v({focused:n.focused}),placeholder:n.locale.placeholder??"Search",autocomplete:"off",spellcheck:"false",onFocus:e[1]||(e[1]=()=>n.focused=!0),onBlur:e[2]||(e[2]=()=>n.focused=!1),onKeyup:[e[3]||(e[3]=P(t=>n.go(n.focusIndex),["enter"])),e[4]||(e[4]=P((...t)=>n.onUp&&n.onUp(...t),["up"])),e[5]||(e[5]=P((...t)=>n.onDown&&n.onDown(...t),["down"]))]},null,42,W),[[$,n.query]]),n.activeSuggestion?(d(),g("ul",{key:0,class:"suggestions",onMouseleave:e[7]||(e[7]=(...t)=>n.unfocus&&n.unfocus(...t))},[(d(!0),g(T,null,M(n.suggestions,(t,c)=>(d(),g("li",{key:c,class:v(["suggestion",{focused:c===n.focusIndex}]),onMousedown:o=>n.go(c),onMouseenter:o=>n.focus(c)},[m("a",{href:t.path,onClick:e[6]||(e[6]=D(()=>{},["prevent"]))},[t.parentPageTitle&&(!n.suggestions[c-1]||n.suggestions[c-1].parentPageTitle!==t.parentPageTitle)?(d(),g("div",Y,b(t.parentPageTitle),1)):S("",!0),m("div",Z,[m("div",nn,b(t.title||t.path),1),m("div",en,[(d(!0),g(T,null,M(t.display,(o,l)=>(d(),g("span",{key:l,class:v(o.type)},b(o.str),3))),128))])])],8,_)],42,z))),128))],32)):S("",!0)])}const sn=E(Q,[["render",tn],["__scopeId","data-v-fd6cd4d5"],["__file","SearchBox.vue"]]);export{sn as default};
